# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Perf monitoring CLI tool for Apple Silicon
brew "asitop"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Console Matrix
brew "cmatrix"
# Create and run Linux containers using lightweight virtual machines
brew "container"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# H.264/AVC encoder
brew "x264"
# H.265/HEVC encoder
brew "x265"
# High-performance, high-quality MPEG-4 video library
brew "xvid"
# Scaling, colorspace conversion, and dithering library
brew "zimg"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# Command-line downloader for image-hosting site galleries and collections
brew "gallery-dl"
# GitHub command-line tool
brew "gh"
# Improved top (interactive process viewer)
brew "htop"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# C/C++ seam carving library
brew "liblqr"
# LLVM's OpenMP runtime library
brew "libomp"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Generic library support script
brew "libtool"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Image loading and rendering library
brew "imlib2"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Terminal file manager
brew "lf"
# Rainbows and unicorns in your console!
brew "lolcat"
# Powerful, lightweight programming language
brew "lua"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Media player based on MPlayer and mplayer2
brew "mpv"
# NCurses Disk Usage
brew "ncdu"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Friendly PIL fork (Python Imaging Library)
brew "pillow"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@14", restart_service: :changed
# Pretty, minimal and fast ZSH prompt
brew "pure"
# Python version management
brew "pyenv"
# SVG rendering tool and library
brew "resvg"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Extremely fast tool to remove dupes and other lint from your filesystem
brew "rmlint"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Parser generator tool
brew "tree-sitter-cli"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Command-line tool for Vapor (Server-side Swift web framework)
brew "vapor"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Feature-rich syntax highlighting for Zsh
brew "zsh-fast-syntax-highlighting"
# Cloud storage service
cask "baidunetdisk"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Create and run Linux containers using lightweight virtual machines
cask "container"
cask "font-jetbrains-mono-nerd-font"
cask "font-maple-mono-nf-cn"
# Messaging app with a focus on speed and security
cask "telegram"
# Free messaging and calling application
cask "wechat"
